Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/national_government/the_irish_government/the_government_chief_whip.html.txt.tmx
Source language: en
Languages: ga

source: The Government Chief Whip is the Minister of State for the Department of the Taoiseach
ga: Is é an tAire Stáit i Roinn an Taoisigh a bhíonn mar Phríomhaoire an Rialtais

source: He or she is responsible for the organisation and co-ordination of Government business in Dáil Éireann
ga: Tá sé/sí freagrach as eagrú agus comhordú a dhéanamh ar ghnóthaí an Rialtais i nDáil Éireann

source: The Chief Whip acts as a channel of communication between the Government and the opposition parties
ga: Bíonn an Príomhaoire ina (h)idirghabhálaí cumarsáide idir an Rialtas agus lucht an fhreasúra

source: The Chief Whip is also responsible for making sure that the Government has a voting majority in the Dáil by ensuring that TDs attend Dáil sessions when a vote is being taken
ga: Tá sé de chúram ar an bPríomhaoire déanamh cinnte go bhfuil tromlach vótála ag an Rialtas sa Dáil agus déanann sí/sí cinnte go bhfuil na Teachtaí Dála go léir i láthair sa Dáil nuair atá vóta á chaitheamh

source: To instruct a TD to attend to vote, he or she can issue a whip
ga: Nuair a chuirtear iallach ar Theachta Dála freastal ar an Dáil ag am vótála, deirtear go n-úsáidtear Lasc

source: The Chief Whip has a function in monitoring the progress made by Government departments in preparing legislation
ga: Tá ról ag an bPríomhaoire monatóireacht a dhéanamh ar an dul chun cinn atá déanta ag na Ranna Rialtais in ullmhú reachtaíochta

source: He or she also arranges for the proposed legislation to be considered and debated in the Dáil
ga: Déanann sé/sí na socruithe le go mbeidh an reachtaíocht mholta curtha ós comhair na Dála le díospóireacht
